I wasn't able to reproduce the crash, but I did observe some issues running an apply. Probably best described using the plan output. First, the minimal reproducer I tried:

```hcl
terraform {
  required_version = ">= 1.4.6"
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "4.67.0"
    }
  }
}

resource "aws_ecs_cluster" "test" {
  name = "test"
}

resource "aws_ecs_task_definition" "test" {
  family = "test"

  container_definitions = <<DEFINITION
[
  {
    "cpu": 128,
    "essential": true,
    "image": "mongo:latest",
    "memory": 128,
    "name": "mongodb"
  }
]
DEFINITION
}

variable "alarm_names" {
  type    = list(string)
  default = []
}

resource "aws_ecs_service" "test" {
  name            = "test"
  cluster         = aws_ecs_cluster.test.id
  task_definition = aws_ecs_task_definition.test.arn
  desired_count   = 1

  dynamic "alarms" {
    for_each = var.alarm_names == null ? [] : [true]
    content {
      enable      = true
      rollback    = true
      alarm_names = var.alarm_names
    }
  }
}
```

This produces the following plan:

```sh
$ terraform plan
...
 # aws_ecs_service.test will be created
  + resource "aws_ecs_service" "test" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "test"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + alarms {
          + enable   = true
          + rollback = true
        }
    }
```

Note the weird looking `alarms` block that has no `alarm_names` attribute? Sure enough, trying to apply this results in:

```sh
$ terraform apply
...
aws_ecs_service.test: Creating...
╷
│ Error: creating ECS Service (test): InvalidParameter: 1 validation error(s) found.
│ - missing required field, CreateServiceInput.DeploymentConfiguration.Alarms.AlarmNames.
│ 
│ 
│   with aws_ecs_service.test,
│   on main.tf line 36, in resource "aws_ecs_service" "test":
│   36: resource "aws_ecs_service" "test" {
```

If we change the `for_each` expression to correctly guard for an empty set, we get what I'd expect to see in the plan:

```hcl
resource "aws_ecs_service" "test" {
  name            = "test"
  cluster         = aws_ecs_cluster.test.id
  task_definition = aws_ecs_task_definition.test.arn
  desired_count   = 1

  dynamic "alarms" {
    for_each = var.alarm_names == null || length(var.alarm_names) == 0 ? [] : [true]
    content {
      enable      = true
      rollback    = true
      alarm_names = var.alarm_names
    }
  }
}
```

```sh
$ terraform plan
...
  # aws_ecs_service.test will be created
  + resource "aws_ecs_service" "test" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "test"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false
    }
```

And the resulting apply works just fine.

If you're able to adjust the minimal reproducer above so that it crashes for you, that'd be useful please. Alternatively, applying that fix for the `for_each` expression might act as a workaround.